create dataframe Student with 3 columns

In [3]:
## create dict and pass it to dataframe
dict= {
"name":["sam", "jhon","ika"],
"roll_no":[101, 103, 104],
"marks": [92, 56, 30]
}

In [4]:
print(dict)

{'name': ['sam', 'jhon', 'ika'], 'roll_no': [101, 103, 104], 'marks': [92, 56, 30]}

In [5]:
import pandas as pd

In [6]:
stud_result= pd.DataFrame(dict)

In [7]:
stud_result

   name  roll_no  marks
0   sam      101     92
1  jhon      103     56
2   ika      104     30

In [9]:
##2nd method

In [12]:
# create Series and pass it to dataframe
x= pd.Series(["sam", "jhon", "max"])
y= pd.Series([101, 103, 104])
z= pd.Series([92, 56, 30])

In [13]:
dict = {"name": x,
       "id": y,
       "marks": z}

In [15]:
stud_result= pd.DataFrame(dict)

In [16]:
stud_result

   name   id  marks
0   sam  101     92
1  jhon  103     56
2   max  104     30

In [17]:
stud_result.empty

False

In [18]:
stud_result.T

         0     1    2
name   sam  jhon  max
id     101   103  104
marks   92    56   30

In [19]:
stud_result.head()

   name   id  marks
0   sam  101     92
1  jhon  103     56
2   max  104     30

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
d = pd.read_csv('Downloads//Bengaluru_House_Data.csv')
d.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
d.area_type.value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [4]:
d2 = d.drop(['area_type', 'availability','society','balcony'], axis=1)
d2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [5]:
d2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64